# 7. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

N = int(input('Введите число:'))
def product(N):
    result = 1

    for i in range(N):
        i += 1
        result *= i
    return(result)

print(f'Произведение чисел равно {product(N)}')